faronov/efr32mg1p-zigbee-sensor/app.c
/**
 * @file app.c
 * @brief Application logic for Zigbee BME280 Sensor
 */

#include "sl_component_catalog.h"
#include "zigbee_app_framework_event.h"
#include "app/framework/include/af.h"
#ifdef SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT
#include "app/framework/plugin/network-steering/network-steering.h"
#endif
#ifdef SL_CATALOG_ZIGBEE_REPORTING_PRESENT
#include "app/framework/plugin/reporting/reporting.h"
#endif
#include "app_profile.h"
#include "app_sensor.h"
#include "app_config.h"
#include "stack/include/network-formation.h"  // For manual network join
#include "stack/include/security.h"
#include "stack/include/binding-table.h"
#include "stack/include/child.h"
#include "hal.h"
#include "sl_sleeptimer.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "sl_spidrv_instances.h"
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT)
#include "sl_power_manager.h"
#endif
#include <stdio.h>
#include <string.h>

// Optional SPIDRV init symbols (generated when SPIDRV component is present).
__attribute__((weak)) void sl_spidrv_exp_init(void);
__attribute__((weak)) void sl_spidrv_init_instances(void);

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
#include "sl_simple_button_instances.h"
#endif

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
#include "sl_simple_led_instances.h"
#endif

// LED blink event for network joining indication
static sl_zigbee_event_t led_blink_event;
static bool led_blink_active = false;

// LED off timer - turn off LED after network join confirmation
static sl_zigbee_event_t led_off_event;

static uint8_t join_attempt_count = 0;
#define JOIN_SCAN_DURATION 3  // Active scan duration (Zigbee scan exponent)

// Button action flags (set by ISR, cleared by main loop)
// Using volatile because these are accessed from both ISR and main context
static volatile bool button_short_press_pending = false;
static volatile bool button_long_press_pending = false;

// Button press duration tracking
static uint32_t button_press_start_tick = 0;
static bool button_pressed = false;
static bool button_long_press_latched = false;
#define BUTTON_DEBOUNCE_MS 30
#ifndef APP_BUTTON_LONG_PRESS_MS
#define APP_BUTTON_LONG_PRESS_MS 5000  // default: 5 seconds for long press
#endif

// Optimized rejoin state machine (TEMPORARILY DISABLED - event queue issue)
// typedef enum {
//   REJOIN_STATE_IDLE,
//   REJOIN_STATE_CURRENT_CHANNEL,
//   REJOIN_STATE_ALL_CHANNELS,
//   REJOIN_STATE_DONE
// } RejoinState_t;

// static sl_zigbee_event_t rejoin_retry_event;
// static RejoinState_t rejoin_state = REJOIN_STATE_IDLE;
// static uint8_t saved_channel = 0;

// Rejoin timeout configuration
#define REJOIN_CURRENT_CHANNEL_TIMEOUT_MS  500   // Wait 500ms before trying all channels
#define REJOIN_FULL_SCAN_TIMEOUT_MS        5000  // Wait 5s for full scan to complete

// Channel mask helper macro
#ifndef BIT32
#define BIT32(n) (((uint32_t)1) << (n))
#endif

#if defined(__GNUC__)
#define APP_UNUSED __attribute__((unused))
#else
#define APP_UNUSED
#endif

#ifndef APP_DEBUG_DIAG_ALWAYS
#define APP_DEBUG_DIAG_ALWAYS 0
#endif
#ifndef APP_DEBUG_SPI_ONLY
#define APP_DEBUG_SPI_ONLY 0
#endif
#ifndef APP_DEBUG_RESET_NETWORK
#define APP_DEBUG_RESET_NETWORK 0
#endif
#ifndef APP_DEBUG_AWAKE_AFTER_JOIN_MS
#define APP_DEBUG_AWAKE_AFTER_JOIN_MS 0
#endif
#ifndef APP_DEBUG_FAST_POLL_AFTER_JOIN_MS
#define APP_DEBUG_FAST_POLL_AFTER_JOIN_MS 0
#endif
#ifndef APP_DEBUG_FAST_POLL_INTERVAL_MS
#define APP_DEBUG_FAST_POLL_INTERVAL_MS 250
#endif
#ifndef APP_DEBUG_MANUAL_POLL_BOOST_MS
#define APP_DEBUG_MANUAL_POLL_BOOST_MS 60000
#endif
#ifndef APP_DEBUG_MANUAL_POLL_INTERVAL_MS
#define APP_DEBUG_MANUAL_POLL_INTERVAL_MS 250
#endif
#ifndef APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS
#define APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS 30000
#endif
#ifndef APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES
#define APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES 0
#endif
#ifndef APP_DEBUG_AUTO_JOIN_ON_BOOT
#define APP_DEBUG_AUTO_JOIN_ON_BOOT 0
#endif
#ifndef APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
#define APP_DEBUG_AUTO_JOIN_ON_PIN_RESET 0
#endif
#ifndef APP_DEBUG_JOIN_AS_END_DEVICE
#define APP_DEBUG_JOIN_AS_END_DEVICE 0
#endif
#ifndef APP_DEBUG_SET_KEEPALIVE_ALL
#define APP_DEBUG_SET_KEEPALIVE_ALL 0
#endif
#ifndef APP_DEBUG_USE_NETWORK_STEERING
#define APP_DEBUG_USE_NETWORK_STEERING 1
#endif
#define APP_DEBUG_PRINTF(...) printf(__VA_ARGS__)

#if defined(SL_CATALOG_ZIGBEE_NETWORK_STEERING_PRESENT) && (APP_DEBUG_USE_NETWORK_STEERING != 0)
#define APP_RUNTIME_NETWORK_STEERING 1
#else
#define APP_RUNTIME_NETWORK_STEERING 0
#endif

static void handle_short_press(void);
static void handle_long_press(void);

void app_debug_sanity(void)
{
  APP_DEBUG_PRINTF("app_debug_sanity\n");
#if APP_DEBUG_DIAG_ALWAYS
  uint8_t endpoint_count = emberAfEndpointCount();
  APP_DEBUG_PRINTF("Debug: endpoint count=%u primary=%u\n",
                   endpoint_count,
                   emberAfPrimaryEndpoint());
  bool ota_client_present = false;
  for (uint8_t i = 0; i < endpoint_count; i++) {
    uint8_t ep = emberAfEndpointFromIndex(i);
    bool has_ota = emberAfContainsClient(ep, ZCL_OTA_BOOTLOAD_CLUSTER_ID);
    if (has_ota) {
      ota_client_present = true;
    }
    APP_DEBUG_PRINTF("Debug: ep %u ota_client=%u\n", ep, has_ota ? 1 : 0);
  }
  if (!ota_client_present) {
    APP_DEBUG_PRINTF("Debug: OTA client cluster missing - expect ep FF writes\n");
  }
#endif
}

void app_debug_trigger_short_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_short_press\n");
  handle_short_press();
}

void app_debug_trigger_long_press(void)
{
  APP_DEBUG_PRINTF("app_debug_trigger_long_press\n");
  handle_long_press();
}

// Zigbee 3.0 channels (11-26)
#define ZIGBEE_CHANNELS_MASK 0x07FFF800

// Single-channel network join state (Series 1 workaround for event queue limitation)
// Try channels in order of popularity: 15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23
static const uint8_t channel_scan_order[] = {15, 20, 25, 11, 14, 19, 24, 26, 12, 13, 16, 17, 18, 21, 22, 23};
static uint8_t current_channel_index = 0;  // Index into channel_scan_order array
static bool network_join_in_progress = false;
static bool join_scan_in_progress = false;
static bool join_network_found = false;
static EmberZigbeeNetwork join_candidate;
static bool af_init_seen = false;
static bool af_init_reported = false;
static bool basic_identity_pending = false;
static bool af_init_force_pending = false;
static uint32_t af_init_force_tick = 0;
static uint32_t basic_identity_tick = 0;
#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
static bool app_join_awake_active = false;
static uint32_t app_join_awake_start_tick = 0;
#endif
#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
static bool app_fast_poll_active = false;
static uint32_t app_fast_poll_start_tick = 0;
#endif
static bool app_manual_poll_boost_active = false;
static uint32_t app_manual_poll_boost_start_tick = 0;
static uint32_t app_manual_poll_boost_last_tick = 0;
static uint32_t app_button_unlock_tick = 0;
#if APP_DEBUG_RESET_NETWORK
static bool debug_reset_network_done = false;
#endif

void app_debug_poll(void);
bool app_debug_button_ready(void);
static bool join_pending = false;
static bool join_security_configured = false;

#ifndef EMBER_ENCRYPTION_KEY_SIZE
#define EMBER_ENCRYPTION_KEY_SIZE 16
#endif

static const uint8_t zigbee_alliance_key[EMBER_ENCRYPTION_KEY_SIZE] = {
  0x5A, 0x69, 0x67, 0x42, 0x65, 0x65, 0x41, 0x6C,
  0x6C, 0x69, 0x61, 0x6E, 0x63, 0x65, 0x30, 0x39
};

// Forward declarations
static void led_blink_event_handler(sl_zigbee_event_t *event);
static void led_off_event_handler(sl_zigbee_event_t *event);
static void rejoin_retry_event_handler(sl_zigbee_event_t *event) APP_UNUSED;
static void start_optimized_rejoin(void) APP_UNUSED;
static void handle_short_press(void);
static void handle_long_press(void);
static EmberStatus start_join_scan(void);
static void try_next_channel(void);
static void configure_join_security(void);
static bool log_basic_identity(void);
static void app_flash_probe(void);
static void app_flash_enable_init(void);
static void app_flash_send_cmd(GPIO_Port_TypeDef port,
                               unsigned int pin,
                               uint8_t cmd);
static bool app_flash_probe_with_cs(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label);
static void app_init_once(void);
#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void);
#endif
static void app_configure_default_reporting(void);

