faronov/efr32mg1p-zigbee-sensor/app.c
#if APP_RUNTIME_NETWORK_STEERING
void emberAfPluginNetworkSteeringCompleteCallback(EmberStatus status,
                                                  uint8_t totalBeacons,
                                                  uint8_t joinAttempts,
                                                  uint8_t finalState)
{
  APP_DEBUG_PRINTF("Join: steering complete status=0x%02x beacons=%u attempts=%u state=%u\n",
                   status,
                   totalBeacons,
                   joinAttempts,
                   finalState);

  // If stack is still down after steering completion, allow a new button-triggered join attempt.
  if (emberAfNetworkState() != EMBER_JOINED_NETWORK) {
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
  }
}
#endif

/**
 * @brief Zigbee application init callback
 *
 * Called when the Zigbee stack has completed initialization.
 * This is where we initialize application components.
 */
static void app_init_once(void)
{
#if APP_DEBUG_SPI_ONLY
  APP_DEBUG_PRINTF("SPI-only debug mode\n");
  app_flash_probe();
  return;
#endif
  if (af_init_seen) {
    APP_DEBUG_PRINTF("AF init callback (duplicate)\n");
    return;
  }
  APP_DEBUG_PRINTF("AF init callback\n");
  af_init_seen = true;
  af_init_force_pending = false;
  af_init_force_tick = 0;

#ifdef SL_CATALOG_SIMPLE_BUTTON_PRESENT
  // TRADFRI boards may not have an external pull-up on BTN0 (PB13).
  // Force internal pull-up + input filter to avoid floating/false presses.
  GPIO_PinModeSet(gpioPortB, 13, gpioModeInputPullFilter, 1);
  APP_DEBUG_PRINTF("BTN0: internal pull-up enabled (PB13)\n");
  // Re-arm simple_button after direct GPIO reconfiguration above.
  sl_button_disable(&sl_button_btn0);
  sl_button_enable(&sl_button_btn0);

  // Drop any stale press state captured before AF init was complete.
  // This avoids false "long press" on the first post-boot release edge.
  button_short_press_pending = false;
  button_long_press_pending = false;
  button_pressed = false;
  button_long_press_latched = false;
  button_press_start_tick = 0;
  app_button_unlock_tick = 0;

#endif

#if APP_DEBUG_RESET_NETWORK
  app_debug_reset_network_state();
#endif
  emberAfCorePrintln("Zigbee BME280 Sensor Application");
  emberAfCorePrintln("Silicon Labs EFR32MG1P + Bosch BME280");
  emberAfCorePrintln("Press BTN0 to join network or trigger sensor reading");

  // Initialize LED events
  sl_zigbee_event_init(&led_blink_event, led_blink_event_handler);
  sl_zigbee_event_init(&led_off_event, led_off_event_handler);

  // Button handling uses emberAfTickCallback() to check flags - no events needed

  // Initialize optimized rejoin event (TEMPORARILY DISABLED - event queue issue)
  // sl_zigbee_event_init(&rejoin_retry_event, rejoin_retry_event_handler);

  // Initialize configuration from NVM
  app_config_init();
  if (!log_basic_identity()) {
    basic_identity_pending = true;
  }

#if APP_DEBUG_DIAG_ALWAYS
  app_flash_probe();
#endif

  // Initialize BME280 sensor
  if (!app_sensor_init()) {
    emberAfCorePrintln("ERROR: Sensor initialization failed!");
#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Rapid blink on error
    for (int i = 0; i < 10; i++) {
      sl_led_toggle(&sl_led_led0);
      sl_sleeptimer_delay_millisecond(100);
    }
#endif
  }

  app_configure_default_reporting();

#if APP_DEBUG_AUTO_JOIN_ON_BOOT
  APP_DEBUG_PRINTF("Debug: auto-join on boot\n");
  handle_short_press();
#endif

#if APP_DEBUG_AUTO_JOIN_ON_PIN_RESET
  // TRADFRI button can be wired to reset line on some hardware revisions.
  // If boot reason is external pin reset, treat it as an implicit join request.
  if (halGetResetInfo() == 0x03u) {
    APP_DEBUG_PRINTF("Debug: auto-join after pin reset\n");
    handle_short_press();
  }
#endif
}

static void app_configure_default_reporting(void)
{
#ifdef SL_CATALOG_ZIGBEE_REPORTING_PRESENT
  EmberAfPluginReportingEntry entry;
  EmberAfStatus st;

  memset(&entry, 0, sizeof(entry));
  entry.direction = EMBER_ZCL_REPORTING_DIRECTION_REPORTED;
  entry.endpoint = 1;
  entry.mask = CLUSTER_MASK_SERVER;
  entry.manufacturerCode = EMBER_AF_NULL_MANUFACTURER_CODE;

  entry.clusterId = ZCL_TEMP_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_TEMP_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 50;   // 0.50 C (0.01C units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: temp -> 0x%02x\n", st);

  entry.clusterId = ZCL_RELATIVE_HUMIDITY_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_RELATIVE_HUMIDITY_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 100;  // 1.00 %RH (0.01% units)
#if (APP_PROFILE_HAS_HUMIDITY != 0)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: humidity -> 0x%02x\n", st);
#else
  APP_DEBUG_PRINTF("Reporting default: humidity skipped by profile\n");
#endif

  entry.clusterId = ZCL_PRESSURE_MEASUREMENT_CLUSTER_ID;
  entry.attributeId = ZCL_PRESSURE_MEASURED_VALUE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 10;
  entry.data.reported.maxInterval = 300;
  entry.data.reported.reportableChange = 1;    // 1 kPa (cluster units)
#if (APP_PROFILE_HAS_PRESSURE != 0)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: pressure -> 0x%02x\n", st);
#else
  APP_DEBUG_PRINTF("Reporting default: pressure skipped by profile\n");
#endif

  entry.clusterId = ZCL_POWER_CONFIG_CLUSTER_ID;
  entry.attributeId = ZCL_BATTERY_VOLTAGE_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 30;
  entry.data.reported.maxInterval = 1800;
  entry.data.reported.reportableChange = 1;    // 0.1V (100mV units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: battery voltage -> 0x%02x\n", st);

  entry.clusterId = ZCL_POWER_CONFIG_CLUSTER_ID;
  entry.attributeId = ZCL_BATTERY_PERCENTAGE_REMAINING_ATTRIBUTE_ID;
  entry.data.reported.minInterval = 30;
  entry.data.reported.maxInterval = 1800;
  entry.data.reported.reportableChange = 2;    // 1% (0.5% units)
  st = emberAfPluginReportingConfigureReportedAttribute(&entry);
  APP_DEBUG_PRINTF("Reporting default: battery pct -> 0x%02x\n", st);
#endif
}

