faronov/efr32mg1p-zigbee-sensor/app.c
void emberAfMainInitCallback(void)
{
  app_init_once();
}

#if APP_DEBUG_RESET_NETWORK
static void app_debug_reset_network_state(void)
{
  if (debug_reset_network_done) {
    return;
  }
  debug_reset_network_done = true;
  emberAfCorePrintln("Debug: resetting network state");
  EmberStatus leave_status = emberLeaveNetwork();
  emberAfCorePrintln("Debug: leave network -> 0x%02X", leave_status);
  EmberStatus bind_status = emberClearBindingTable();
  emberAfCorePrintln("Debug: clear binding table -> 0x%02X", bind_status);
  EmberStatus key_status = emberClearKeyTable();
  emberAfCorePrintln("Debug: clear key table -> 0x%02X", key_status);
  join_attempt_count = 0;
  current_channel_index = 0;
  join_scan_in_progress = false;
  join_network_found = false;
  network_join_in_progress = false;
}
#endif

void app_debug_force_af_init(void)
{
#if defined(APP_DEBUG_FORCE_AF_INIT) && (APP_DEBUG_FORCE_AF_INIT != 0)
  if (!af_init_seen) {
    APP_DEBUG_PRINTF("AF init requested (debug)\n");
    af_init_force_pending = true;
  }
#endif
}

void app_debug_poll(void)
{
  uint32_t now = sl_sleeptimer_get_tick_count();
  bool button_guard_active = (app_button_unlock_tick != 0)
                             && ((int32_t)(app_button_unlock_tick - now) > 0);

  if (!af_init_reported && af_init_seen) {
    af_init_reported = true;
    APP_DEBUG_PRINTF("AF init seen (tick)\n");
  }

  if (af_init_force_pending && !af_init_seen) {
    if (af_init_force_tick == 0) {
      af_init_force_tick = now;
    } else if (sl_sleeptimer_tick_to_ms(now - af_init_force_tick) >= 2000) {
      APP_DEBUG_PRINTF("AF init timeout - fallback callback\n");
      app_init_once();
      af_init_force_pending = false;
    }
  }

#if defined(SL_CATALOG_SIMPLE_BUTTON_PRESENT) && (APP_DEBUG_POLL_SIMPLE_BUTTON_INSTANCES != 0)
  // Keep simple_button state machine updated even if AF tick callback isn't
  // scheduled frequently on this target.
  sl_simple_button_poll_instances();
#endif

  // Some debug builds run without AF tick wiring, so process deferred joins here.
  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting (poll)\n");
    handle_short_press();
  }

  // Some targets do not run emberAfTickCallback reliably in this app flow.
  // Consume button flags here as well to guarantee action dispatch.
  if (button_short_press_pending) {
    button_short_press_pending = false;
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: short press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button short press\n");
      emberAfCorePrintln("Button: Short press detected (poll callback)");
      handle_short_press();
    }
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: long press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button long press\n");
      emberAfCorePrintln("Button: Long press detected (poll callback)");
      handle_long_press();
    }
  }

  // Robust long-press detect: trigger while held (do not wait for RELEASE edge).
  // This avoids missed long-press actions when release edges are noisy/missed.
  if (button_pressed && !button_long_press_latched) {
    uint32_t held_ticks = now - button_press_start_tick;
    uint32_t held_ms = sl_sleeptimer_tick_to_ms(held_ticks);
    if (held_ms >= APP_BUTTON_LONG_PRESS_MS) {
      button_long_press_latched = true;
      button_long_press_pending = true;
      APP_DEBUG_PRINTF("BTN0: HOLD LONG (%lu ms)\n", (unsigned long)held_ms);
    }
  }

  if (basic_identity_pending && af_init_seen) {
    if (basic_identity_tick == 0 ||
        sl_sleeptimer_tick_to_ms(now - basic_identity_tick) >= 2000) {
      basic_identity_tick = now;
      if (log_basic_identity()) {
        basic_identity_pending = false;
      }
    }
  }

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
  if (app_join_awake_active && app_join_awake_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_join_awake_start_tick);
    if (elapsed_ms >= APP_DEBUG_AWAKE_AFTER_JOIN_MS) {
      sl_power_manager_remove_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = false;
      app_join_awake_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: post-join awake window ended\n");
    }
  }
#endif

#if (APP_DEBUG_FAST_POLL_AFTER_JOIN_MS > 0)
  if (app_fast_poll_active && app_fast_poll_start_tick != 0) {
    uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_fast_poll_start_tick);
    if (elapsed_ms >= APP_DEBUG_FAST_POLL_AFTER_JOIN_MS) {
      emberAfSetDefaultPollControlCallback(EMBER_AF_LONG_POLL);
      emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL);
      emberAfRemoveFromCurrentAppTasksCallback(EMBER_AF_FORCE_SHORT_POLL_FOR_PARENT_CONNECTIVITY);
      emberAfSetDefaultSleepControl(EMBER_AF_OK_TO_SLEEP);
      app_fast_poll_active = false;
      app_fast_poll_start_tick = 0;
      APP_DEBUG_PRINTF("Debug: fast poll window ended\n");
    }
  }
#endif

#if (APP_DEBUG_MANUAL_POLL_BOOST_MS > 0)
  if (app_manual_poll_boost_active) {
    if (emberAfNetworkState() != EMBER_JOINED_NETWORK) {
      app_manual_poll_boost_active = false;
      app_manual_poll_boost_start_tick = 0;
      app_manual_poll_boost_last_tick = 0;
    } else {
      uint32_t elapsed_ms = sl_sleeptimer_tick_to_ms(now - app_manual_poll_boost_start_tick);
      if (elapsed_ms >= APP_DEBUG_MANUAL_POLL_BOOST_MS) {
        app_manual_poll_boost_active = false;
        app_manual_poll_boost_start_tick = 0;
        app_manual_poll_boost_last_tick = 0;
        APP_DEBUG_PRINTF("Debug: manual poll boost window ended\n");
      } else if (app_manual_poll_boost_last_tick == 0
                 || sl_sleeptimer_tick_to_ms(now - app_manual_poll_boost_last_tick)
                 >= APP_DEBUG_MANUAL_POLL_INTERVAL_MS) {
        app_manual_poll_boost_last_tick = now;
        EmberStatus poll_st = emberPollForData();
        if (poll_st != EMBER_SUCCESS && poll_st != EMBER_MAC_SCANNING) {
          APP_DEBUG_PRINTF("Debug: manual poll -> 0x%02x\n", poll_st);
        }
      }
    }
  }
#endif
}

