faronov/efr32mg1p-zigbee-sensor/app.c
bool app_debug_button_ready(void)
{
  return af_init_seen;
}

static bool log_basic_identity(void)
{
  uint8_t buf[1 + 32];
  char str[33];
  EmberAfStatus st;
  uint8_t endpoint_count = emberAfEndpointCount();
  if (endpoint_count == 0) {
    APP_DEBUG_PRINTF("Basic: endpoints not ready (count=0)\n");
    return false;
  }
  uint8_t endpoint = emberAfEndpointFromIndex(0);
  APP_DEBUG_PRINTF("Basic: using endpoint %u (count=%u)\n",
                   endpoint,
                   endpoint_count);

#ifdef ZCL_POWER_SOURCE_ATTRIBUTE_ID
  {
    uint8_t power_source = 0x03; // Battery
    EmberAfStatus wr = emberAfWriteServerAttribute(endpoint,
                                                    ZCL_BASIC_CLUSTER_ID,
                                                    ZCL_POWER_SOURCE_ATTRIBUTE_ID,
                                                    &power_source,
                                                    ZCL_ENUM8_ATTRIBUTE_TYPE);
    APP_DEBUG_PRINTF("Basic: set power source(battery) -> 0x%02x\n", wr);
  }
#endif

#ifdef ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MANUFACTURER_NAME_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: manufacturer=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: manufacturer read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_MODEL_IDENTIFIER_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: model=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: model read -> 0x%02x\n", st);
  }
#endif

#ifdef ZCL_SW_BUILD_ID_ATTRIBUTE_ID
  st = emberAfReadServerAttribute(endpoint,
                                  ZCL_BASIC_CLUSTER_ID,
                                  ZCL_SW_BUILD_ID_ATTRIBUTE_ID,
                                  buf,
                                  sizeof(buf));
  if (st == EMBER_ZCL_STATUS_SUCCESS) {
    uint8_t len = buf[0] > 32 ? 32 : buf[0];
    memcpy(str, &buf[1], len);
    str[len] = '\0';
    APP_DEBUG_PRINTF("Basic: sw build=\"%s\"\n", str);
  } else {
    APP_DEBUG_PRINTF("Basic: sw build read -> 0x%02x\n", st);
  }
#endif
  return true;
}

static void app_flash_probe(void)
{
  app_flash_enable_init();

  static bool spidrv_inited = false;
  if (!spidrv_inited) {
    if (sl_spidrv_exp_init != NULL) {
      sl_spidrv_exp_init();
    } else if (sl_spidrv_init_instances != NULL) {
      sl_spidrv_init_instances();
    } else {
      APP_DEBUG_PRINTF("SPI flash: SPIDRV init symbol missing\n");
    }
    spidrv_inited = true;
    APP_DEBUG_PRINTF("SPI flash: SPIDRV exp init (handle=%p)\n",
                     (void *)sl_spidrv_exp_handle);
#ifdef SL_SPIDRV_EXP_PERIPHERAL
    USART_TypeDef *periph = SL_SPIDRV_EXP_PERIPHERAL;
    const char *periph_name = "USART?";
    if (periph == USART0) {
      periph_name = "USART0";
    } else if (periph == USART1) {
      periph_name = "USART1";
    }
    APP_DEBUG_PRINTF("SPI flash: %s ROUTELOC0=0x%08lX ROUTEPEN=0x%08lX\n",
                     periph_name,
                     (unsigned long)periph->ROUTELOC0,
                     (unsigned long)periph->ROUTEPEN);
#endif
#ifdef SL_SPIDRV_EXP_TX_LOC
    APP_DEBUG_PRINTF("SPI flash: SPIDRV loc tx=%u rx=%u clk=%u\n",
                     (unsigned)SL_SPIDRV_EXP_TX_LOC,
                     (unsigned)SL_SPIDRV_EXP_RX_LOC,
                     (unsigned)SL_SPIDRV_EXP_CLK_LOC);
#endif
  }

  if (!app_flash_probe_with_cs(gpioPortB, 11, "PB11")) {
    APP_DEBUG_PRINTF("SPI flash: no response on PB11\n");
  }
}

static void app_flash_enable_init(void)
{
  static bool configured = false;
  if (configured) {
    return;
  }
  // ICC-1 exposes PF3; ICC-A-1 uses PF3 internally to enable the SPI flash.
  GPIO_PinModeSet(gpioPortF, 3, gpioModePushPull, 1);
  APP_DEBUG_PRINTF("SPI flash: enable PF3=1\n");
  configured = true;
}

static void app_flash_send_cmd(GPIO_Port_TypeDef port,
                               unsigned int pin,
                               uint8_t cmd)
{
  app_flash_enable_init();
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);
  uint8_t tx[1] = {cmd};
  GPIO_PinOutClear(port, pin);
  (void)SPIDRV_MTransmitB(sl_spidrv_exp_handle, tx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
}

static bool app_flash_probe_with_cs(GPIO_Port_TypeDef port,
                                    unsigned int pin,
                                    const char *label)
{
  GPIO_PinModeSet(port, pin, gpioModePushPull, 1);

  app_flash_send_cmd(port, pin, 0xFF); // Release from continuous read (safe no-op)
  app_flash_send_cmd(port, pin, 0xAB); // Release from deep power-down
  app_flash_send_cmd(port, pin, 0x66); // Reset enable
  app_flash_send_cmd(port, pin, 0x99); // Reset memory
  sl_sleeptimer_delay_millisecond(1);

  uint8_t tx[4] = {0x9F, 0x00, 0x00, 0x00};
  uint8_t rx[4] = {0};

  GPIO_PinOutClear(port, pin);
  Ecode_t status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, sizeof(tx));
  GPIO_PinOutSet(port, pin);
  if (status != ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: JEDEC read failed (%s, 0x%lx)\n",
                     label,
                     (unsigned long)status);
    return false;
  }

  APP_DEBUG_PRINTF("SPI flash: JEDEC ID %02X %02X %02X (%s)\n",
                   rx[1],
                   rx[2],
                   rx[3],
                   label);

  tx[0] = 0x05; // Read Status Register-1
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR1=0x%02X (%s)\n", rx[1], label);
  }

  tx[0] = 0x35; // Read Status Register-2
  memset(rx, 0, sizeof(rx));
  GPIO_PinOutClear(port, pin);
  status = SPIDRV_MTransferB(sl_spidrv_exp_handle, tx, rx, 2);
  GPIO_PinOutSet(port, pin);
  if (status == ECODE_OK) {
    APP_DEBUG_PRINTF("SPI flash: SR2=0x%02X (%s)\n", rx[1], label);
  }

  return !((rx[1] == 0x00 && rx[2] == 0x00 && rx[3] == 0x00)
           || (rx[1] == 0xFF && rx[2] == 0xFF && rx[3] == 0xFF));
}


/**
 * @brief Network join success callback
 *
 * Called when the device successfully joins a Zigbee network.
 */
void emberAfStackStatusCallback(EmberStatus status)
{
#if APP_DEBUG_SPI_ONLY
  (void)status;
  return;
#endif
  uint32_t now = sl_sleeptimer_get_tick_count();
  APP_DEBUG_PRINTF("Stack status: 0x%02x\n", status);
  if (status == EMBER_NETWORK_UP) {
    emberAfCorePrintln("Network joined successfully");
    EmberNodeType runtime_node_type = EMBER_UNKNOWN_DEVICE;
    if (emberGetNodeType(&runtime_node_type) == EMBER_SUCCESS) {
      APP_DEBUG_PRINTF("Join: runtime node type=%u\n", runtime_node_type);
    }

#if APP_DEBUG_SET_KEEPALIVE_ALL
    // Optional debug override: force keep-alive support mode.
    EmberStatus ka_status = emberSetKeepAliveMode(EMBER_KEEP_ALIVE_SUPPORT_ALL);
    APP_DEBUG_PRINTF("Join: set keep-alive mode(all) -> 0x%02x\n", ka_status);
#else
    APP_DEBUG_PRINTF("Join: keep-alive mode: stack default\n");
#endif
    app_button_unlock_tick = now + sl_sleeptimer_ms_to_tick(APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS);
    APP_DEBUG_PRINTF("Button guard: ignoring BTN0 for %lu ms after join\n",
                     (unsigned long)APP_DEBUG_BUTTON_GUARD_AFTER_JOIN_MS);

#if (APP_DEBUG_MANUAL_POLL_BOOST_MS > 0)
    if (runtime_node_type == EMBER_SLEEPY_END_DEVICE) {
      app_manual_poll_boost_active = true;
      app_manual_poll_boost_start_tick = sl_sleeptimer_get_tick_count();
      app_manual_poll_boost_last_tick = 0;
      APP_DEBUG_PRINTF("Debug: manual poll boost enabled for %lu ms (interval=%lu ms)\n",
                       (unsigned long)APP_DEBUG_MANUAL_POLL_BOOST_MS,
                       (unsigned long)APP_DEBUG_MANUAL_POLL_INTERVAL_MS);
    } else {
      app_manual_poll_boost_active = false;
      app_manual_poll_boost_start_tick = 0;
      app_manual_poll_boost_last_tick = 0;
    }
#endif

#if defined(SL_CATALOG_POWER_MANAGER_PRESENT) && (APP_DEBUG_AWAKE_AFTER_JOIN_MS > 0)
    if (!app_join_awake_active) {
      sl_power_manager_add_em_requirement(SL_POWER_MANAGER_EM0);
      app_join_awake_active = true;
      app_join_awake_start_tick = sl_sleeptimer_get_tick_count();
      APP_DEBUG_PRINTF("Debug: keeping EM0 for %lu ms after join\n",
                       (unsigned long)APP_DEBUG_AWAKE_AFTER_JOIN_MS);
    }
#endif

