faronov/efr32mg1p-zigbee-sensor/app.c
  app_debug_poll();

#if APP_DEBUG_SPI_ONLY
  if (button_short_press_pending) {
    button_short_press_pending = false;
    APP_DEBUG_PRINTF("Button short press\n");
    app_flash_probe();
  }

  if (button_long_press_pending) {
    button_long_press_pending = false;
    APP_DEBUG_PRINTF("Button long press\n");
    app_flash_probe();
  }
  return;
#endif

  if (join_pending && af_init_seen && !network_join_in_progress) {
    join_pending = false;
    APP_DEBUG_PRINTF("Join: deferred request starting\n");
    handle_short_press();
  }

  if (last_heartbeat_tick == 0 ||
      sl_sleeptimer_tick_to_ms(now - last_heartbeat_tick) >= 5000) {
    last_heartbeat_tick = now;
    APP_DEBUG_PRINTF("Heartbeat: net=%d join_in_progress=%d\n",
                     emberAfNetworkState(),
                     network_join_in_progress);
    if (APP_DEBUG_DIAG_ALWAYS) {
      EmberNetworkStatus state = emberAfNetworkState();
      APP_DEBUG_PRINTF("Zigbee state=%d, joined=%d\n",
                       state,
                       (state == EMBER_JOINED_NETWORK));
    }
  }

  // Check for short press
  if (button_short_press_pending) {
    button_short_press_pending = false;  // Clear flag
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: short press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button short press\n");
      emberAfCorePrintln("Button: Short press detected (tick callback)");
      handle_short_press();
    }
  }

  // Check for long press
  if (button_long_press_pending) {
    button_long_press_pending = false;  // Clear flag
    if (button_guard_active) {
      APP_DEBUG_PRINTF("Button guard: long press ignored\n");
    } else {
      APP_DEBUG_PRINTF("Button long press\n");
      emberAfCorePrintln("Button: Long press detected (tick callback)");
      handle_long_press();
    }
  }
}

/**
 * @brief Optimized rejoin retry event handler
 *
 * Manages the rejoin state machine:
 * 1. Try current channel first (fast path)
 * 2. If timeout, try all channels (fallback)
 */
static void rejoin_retry_event_handler(sl_zigbee_event_t *event)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
  (void)event;  // Unused parameter
}

/**
 * @brief Start optimized rejoin - try current channel first
 *
 * Optimization: Attempt rejoin on previously-used channel first for fast
 * reconnection (~138ms vs ~2.2s). Falls back to full channel scan after
 * timeout if current channel doesn't respond.
 *
 * Benefits:
 * - 7x faster rejoin when successful (typical case)
 * - ~85% power savings for successful rejoins
 * - Graceful fallback to full scan if network changed
 */
static void start_optimized_rejoin(void)
{
  // TEMPORARILY DISABLED - event queue issue
  // Optimized rejoin functionality removed to reduce event usage
}

/**
 * @brief Try next channel in the scan sequence
 *
 * Move to next channel and attempt join. If all channels exhausted,
 * report failure and stop scanning.
 */
static void try_next_channel(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

  if (join_scan_in_progress) {
    APP_DEBUG_PRINTF("Join: scan already in progress\n");
    return;
  }

  // Move to next channel
  current_channel_index++;

  while (current_channel_index < total_channels) {
    EmberStatus status = start_join_scan();
    if (status == EMBER_SUCCESS) {
      return;
    }
    APP_DEBUG_PRINTF("Join: scan start failed on ch %d status 0x%02x\n",
                     channel_scan_order[current_channel_index],
                     status);
    current_channel_index++;
  }

  if (current_channel_index >= total_channels) {
    // Exhausted all channels - give up
    emberAfCorePrintln("All channels scanned - no network found");
    network_join_in_progress = false;
    join_scan_in_progress = false;
    join_network_found = false;
    current_channel_index = 0;
    join_attempt_count++;

#ifdef SL_CATALOG_SIMPLE_LED_PRESENT
    // Stop LED blinking
    led_blink_active = false;
    sl_zigbee_event_set_inactive(&led_blink_event);
    sl_led_turn_off(&sl_led_led0);
#endif
  }
}

/**
 * @brief Start an active scan on the current channel
 *
 * Series 1 Workaround: Scans ONE channel at a time instead of all 16 channels
 * simultaneously. This prevents event queue overflow on Series 1 chips.
 */
static EmberStatus start_join_scan(void)
{
  const uint8_t total_channels = sizeof(channel_scan_order) / sizeof(channel_scan_order[0]);

  if (current_channel_index >= total_channels) {
    emberAfCorePrintln("ERROR: Invalid channel index %d", current_channel_index);
    return EMBER_INVALID_CALL;
  }

  uint8_t channel_to_scan = channel_scan_order[current_channel_index];
  uint32_t single_channel_mask = BIT32(channel_to_scan);

  emberAfCorePrintln("Active scan channel %d (%d of %d)...",
                     channel_to_scan,
                     current_channel_index + 1,
                     total_channels);
  APP_DEBUG_PRINTF("Join: start scan channel %d mask 0x%08lx\n",
                   channel_to_scan,
                   (unsigned long)single_channel_mask);

  join_scan_in_progress = true;
  join_network_found = false;
  memset(&join_candidate, 0, sizeof(join_candidate));

  // Scan ONLY this one channel - uses minimal events
  EmberStatus status = emberStartScan(EMBER_ACTIVE_SCAN, single_channel_mask, JOIN_SCAN_DURATION);
  APP_DEBUG_PRINTF("Join: emberStartScan -> 0x%02x\n", status);

  if (status != EMBER_SUCCESS) {
    emberAfCorePrintln("Failed to start scan on channel %d: 0x%x", channel_to_scan, status);
    join_scan_in_progress = false;
  }

  return status;
}

/**
 * @brief Scan result callback (called for each network found)
 */
void emberAfNetworkFoundCallback(EmberZigbeeNetwork *networkFound, uint8_t lqi, int8_t rssi)
{
#if APP_RUNTIME_NETWORK_STEERING
  // Network Steering plugin owns scan callbacks when present.
  (void)networkFound;
  (void)lqi;
  (void)rssi;
  return;
#else
  if (!network_join_in_progress || networkFound == NULL) {
    return;
  }

  if (!networkFound->allowingJoin) {
    APP_DEBUG_PRINTF("Join: network ch %d pan 0x%04x not open (lqi=%u rssi=%d)\n",
                     networkFound->channel,
                     networkFound->panId,
                     lqi,
                     rssi);
    return;
  }

  if (!join_network_found) {
    join_network_found = true;
    join_candidate = *networkFound;
    APP_DEBUG_PRINTF("Join: found network ch %d pan 0x%04x (lqi=%u rssi=%d)\n",
                     join_candidate.channel,
                     join_candidate.panId,
                     lqi,
                     rssi);
  }
#endif
}

/**
 * @brief Scan completion callback
 */
void emberAfScanCompleteCallback(uint8_t channel, EmberStatus status)
{
#if APP_RUNTIME_NETWORK_STEERING
  // Network Steering plugin owns scan callbacks when present.
  (void)channel;
  (void)status;
  return;
#else
  if (!network_join_in_progress) {
    return;
  }

  join_scan_in_progress = false;
  APP_DEBUG_PRINTF("Join: scan complete ch=%u status=0x%02x found=%d\n",
                   channel,
                   status,
                   join_network_found ? 1 : 0);

  if (join_network_found) {
    EmberNetworkParameters params;
    memset(&params, 0, sizeof(params));
    memcpy(params.extendedPanId, join_candidate.extendedPanId, EXTENDED_PAN_ID_SIZE);
    params.panId = join_candidate.panId;
    params.radioChannel = join_candidate.channel;
    params.radioTxPower = emberGetRadioPower();
    params.joinMethod = EMBER_USE_MAC_ASSOCIATION;
    params.nwkManagerId = 0x0000;
    params.nwkUpdateId = join_candidate.nwkUpdateId;
    params.channels = BIT32(join_candidate.channel);

